# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azuread_application.kv_sp: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04MGJmZjNlNi0xNmM0LTQ4MzktOWNlOC02MGMxYTgzMWNlNTI7b2JqZWN0SWQ9YjU5YWI3YjktZGIzOC00YmQzLTg2MTQtZTZkMTBhZDcwYjExO3N1YnNjcmlwdGlvbklkPTdiNmY4ZjE1LTNhM2UtNDNhMi1iNmFjLThlYjZjMDZhZDEwMzt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azuread_application.kv_sp: Still reading... [10s elapsed]
data.azuread_application.kv_sp: Read complete after 20s [id=/applications/c28691c7-9899-4e43-8292-86b99b0ed3d8]
data.azuread_service_principal.aks_sp: Reading...
data.azuread_service_principal.aks_sp: Read complete after 2s [id=/servicePrincipals/624533ce-2ca8-47a9-886d-6e667defc442]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azuread_application.admin_app_reg will be updated in-place
  ~ resource "azuread_application" "admin_app_reg" {
      ~ group_membership_claims        = [
          - "All",
          + "SecurityGroup",
        ]
        id                             = "/applications/19563ae3-78e5-4be9-b188-01798422bb3b"
        tags                           = []
        # (24 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # azuread_application.easyauth_app_reg will be created
  + resource "azuread_application" "easyauth_app_reg" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "dd-test-easyauth-app"
      + group_membership_claims     = [
          + "SecurityGroup",
        ]
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "b59ab7b9-db38-4bd3-8614-e6d10ad70b11",
        ]
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags (known after apply)

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "5b567255-7703-4780-807c-7be8301ae99b"
              + type = "Scope"
            }
        }

      + web {
          + redirect_uris = [
              + "https://dd-test-easyauth-app-cggdg2ekf9agf8fk.norwayeast-01.azurewebsites.net/.auth/login/aad/callback",
            ]

          + implicit_grant {
              + access_token_issuance_enabled = true
              + id_token_issuance_enabled     = true
            }
        }
    }

  # azuread_application_password.easyauth_app_secret_V2 will be created
  + resource "azuread_application_password" "easyauth_app_secret_V2" {
      + application_id = (known after apply)
      + display_name   = "dd-test-easyauth-app"
      + end_date       = (known after apply)
      + id             = (known after apply)
      + key_id         = (known after apply)
      + start_date     = (known after apply)
      + value          = (sensitive value)
    }

  # azuread_service_principal.easyauth_app_sp will be created
  + resource "azuread_service_principal" "easyauth_app_sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "b59ab7b9-db38-4bd3-8614-e6d10ad70b11",
        ]
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # azurerm_key_vault_secret.admin_app_client_secret will be updated in-place
  ~ resource "azurerm_key_vault_secret" "admin_app_client_secret" {
      ~ expiration_date         = "2027-06-18T14:16:25Z" -> "2027-06-18T14:16:25.3694326Z"
        id                      = "https://oed-kv.vault.azure.net/secrets/dd-admin-app-client-secret/fea13654767041a1af90e5033b057e77"
        name                    = "dd-admin-app-client-secret"
      ~ not_before_date         = "2025-06-18T14:16:25Z" -> "2025-06-18T14:16:25.3694326Z"
        tags                    = {}
        # (8 unchanged attributes hidden)
    }

  # azurerm_linux_web_app.easyauth_app will be updated in-place
  ~ resource "azurerm_linux_web_app" "easyauth_app" {
        id                                             = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Web/sites/dd-test-easyauth-app"
        name                                           = "dd-test-easyauth-app"
        tags                                           = {}
        # (26 unchanged attributes hidden)

      ~ auth_settings_v2 {
            # (12 unchanged attributes hidden)

          ~ active_directory_v2 {
              ~ allowed_applications                 = [
                  - "cdf0585d-b7b4-4d6d-8192-42af06e2745f",
                ] -> (known after apply)
              ~ allowed_audiences                    = [
                  - "api://cdf0585d-b7b4-4d6d-8192-42af06e2745f",
                ] -> (known after apply)
              ~ client_id                            = "cdf0585d-b7b4-4d6d-8192-42af06e2745f" -> (known after apply)
                # (9 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @kurt70 |
| Action | `pull_request` |
| Working Directory | `./infra/altinn-digdir-oed-tt02-rg` |
| State File | `github.com/altinn/dd-infrastructure/environments/test/altinn-digdir-oed-tt02-rg.tfstate` |
| Plan File | `github.com_altinn_dd-infrastructure_environments_test_altinn-digdir-oed-tt02-rg.tfstate.tfplan`